Examinator/src/InformationRegisters/ДанныеФайлыСУЗ/ДанныеФайлыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеФайлыСУЗ</name>
  <resources>
    <name>ПрисоединенныйФайл</name>
    <type>
      <types>CatalogRef.ФайлыСУЗПрисоединенныеФайлы</types>
    </type>
  </resources>
  <resources>
    <name>ТекстовыеДанные</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДвоичныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеОбмена</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ТипыФайловСУЗ/ТипыФайловСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыФайловСУЗ</name>
  <enumValues>
    <name>Default</name>
  </enumValues>
  <enumValues>
    <name>Folder</name>
  </enumValues>
  <enumValues>
    <name>Media</name>
  </enumValues>
  <enumValues>
    <name>Image</name>
  </enumValues>
  <enumValues>
    <name>Video</name>
  </enumValues>
  <enumValues>
    <name>Audio</name>
  </enumValues>
  <enumValues>
    <name>Document</name>
  </enumValues>
  <enumValues>
    <name>DataProcessor</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/CommonModules/РазработкаСУЗПовтИсп/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ФАЙЛЫ

Функция ПолучитьСоответствиеРасширенияПоТипамФайлов() Экспорт
	
	ТипПоУмолчанию = Перечисления.ТипыФайловСУЗ.Default;
	ТипМедиаобъект = Перечисления.ТипыФайловСУЗ.Media;
	ТипИзображение = Перечисления.ТипыФайловСУЗ.Image;
	ТипКаталог     = Перечисления.ТипыФайловСУЗ.Folder;
	ТипВидео       = Перечисления.ТипыФайловСУЗ.Video;
	ТипАудио       = Перечисления.ТипыФайловСУЗ.Audio;
	ТипОбработка   = Перечисления.ТипыФайловСУЗ.DataProcessor;
	
	СоответствиеПоРасширению = Новый Структура();
	
	СоответствиеПоРасширению.Вставить("_gif", ТипИзображение);
	СоответствиеПоРасширению.Вставить("_jpg", ТипИзображение);
	СоответствиеПоРасширению.Вставить("_jpeg", ТипИзображение);
	СоответствиеПоРасширению.Вставить("_tiff", ТипИзображение);
	СоответствиеПоРасширению.Вставить("_bmp", ТипИзображение);
	СоответствиеПоРасширению.Вставить("_png", ТипИзображение);
	СоответствиеПоРасширению.Вставить("_wmf", ТипИзображение);
	СоответствиеПоРасширению.Вставить("_emf", ТипИзображение);
	
	СоответствиеПоРасширению.Вставить("_swf", ТипМедиаобъект);
	
	СоответствиеПоРасширению.Вставить("_asx", ТипВидео);
	СоответствиеПоРасширению.Вставить("_asf", ТипВидео);
	СоответствиеПоРасширению.Вставить("_avi", ТипВидео);
	СоответствиеПоРасширению.Вставить("_flv", ТипВидео);
	СоответствиеПоРасширению.Вставить("_mov", ТипВидео);
	СоответствиеПоРасширению.Вставить("_mpg", ТипВидео);
	СоответствиеПоРасширению.Вставить("_mpeg", ТипВидео);
	СоответствиеПоРасширению.Вставить("_mp4", ТипВидео);
	СоответствиеПоРасширению.Вставить("_qt", ТипВидео);
	СоответствиеПоРасширению.Вставить("_ra", ТипВидео);
	СоответствиеПоРасширению.Вставить("_smil", ТипВидео);
	СоответствиеПоРасширению.Вставить("_wmv", ТипВидео);
	СоответствиеПоРасширению.Вставить("_3g2", ТипВидео);
	СоответствиеПоРасширению.Вставить("_3gp", ТипВидео);
	СоответствиеПоРасширению.Вставить("_ogv", ТипВидео);
	СоответствиеПоРасширению.Вставить("_webm", ТипВидео);
	СоответствиеПоРасширению.Вставить("_mkv", ТипВидео);
	
	СоответствиеПоРасширению.Вставить("_aif", ТипАудио);
	СоответствиеПоРасширению.Вставить("_aac", ТипАудио);
	СоответствиеПоРасширению.Вставить("_au", ТипАудио);
	СоответствиеПоРасширению.Вставить("_gsm", ТипАудио);
	СоответствиеПоРасширению.Вставить("_mid", ТипАудио);
	СоответствиеПоРасширению.Вставить("_midi", ТипАудио);
	СоответствиеПоРасширению.Вставить("_mp3", ТипАудио);
	СоответствиеПоРасширению.Вставить("_m4a", ТипАудио);
	СоответствиеПоРасширению.Вставить("_snd", ТипАудио);
	СоответствиеПоРасширению.Вставить("_ra", ТипАудио);
	СоответствиеПоРасширению.Вставить("_ram", ТипАудио);
	СоответствиеПоРасширению.Вставить("_rm", ТипАудио);
	СоответствиеПоРасширению.Вставить("_wav", ТипАудио);
	СоответствиеПоРасширению.Вставить("_wma", ТипАудио);
	
	СоответствиеПоРасширению.Вставить("_doc", ТипПоУмолчанию);
	СоответствиеПоРасширению.Вставить("_pdf", ТипПоУмолчанию);
	СоответствиеПоРасширению.Вставить("_docx", ТипПоУмолчанию);
	СоответствиеПоРасширению.Вставить("_xls", ТипПоУмолчанию);
	СоответствиеПоРасширению.Вставить("_xlsx", ТипПоУмолчанию);
	СоответствиеПоРасширению.Вставить("_rtf", ТипПоУмолчанию);
	СоответствиеПоРасширению.Вставить("_ppt", ТипПоУмолчанию);
	СоответствиеПоРасширению.Вставить("_pptx", ТипПоУмолчанию);
	СоответствиеПоРасширению.Вставить("_htm", ТипПоУмолчанию);
	СоответствиеПоРасширению.Вставить("_html", ТипПоУмолчанию);
	
	СоответствиеПоРасширению.Вставить("_epf", ТипОбработка);
	
	Возврат Новый ФиксированнаяСтруктура(СоответствиеПоРасширению);
	
КонецФункции

Функция ПолучитьМаксимальныйРазмерФайла() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат Константы.МаксимальныйРазмерФайлаСУЗ.Получить()*1048576;
	
КонецФункции

Функция ПолучитьМассивРазрешенныхРасширенийФайлов() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РасширенияСтрока = НРег(Константы.РазрешенныеРасширенияФайловСУЗ.Получить());
	
	Если ЗначениеЗаполнено(РасширенияСтрока) Тогда
		Возврат Новый ФиксированныйМассив(ОбщегоНазначенияСУКлиентСервер.РасщепитьСтроку(РасширенияСтрока, " "));
	Иначе
		Возврат Новый ФиксированныйМассив(Новый Массив());
	КонецЕсли;
	
КонецФункции

Функция ДополнительныеФорматыВидео(Файл = Неопределено) Экспорт
	
	ФорматыВидео = Справочники.ФайлыСУЗ.ДоступныеФорматыВидео();	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеФайлыСУЗ.СсылкаНаОбъектСУЗ КАК Файл,
		|	ДанныеФайлыСУЗ.КодДанных КАК Формат
		|ИЗ
		|	РегистрСведений.ДанныеФайлыСУЗ КАК ДанныеФайлыСУЗ
		|ГДЕ
		|	ДанныеФайлыСУЗ.КодДанных В(&ФорматыВидео)";
	
	Запрос.УстановитьПараметр("ФорматыВидео", ФорматыВидео);
	
	Если ЗначениеЗаполнено(Файл) Тогда
		
		Запрос.Текст = Запрос.Текст + " И ДанныеФайлыСУЗ.СсылкаНаОбъектСУЗ = &Файл ";
		
		Запрос.УстановитьПараметр("Файл", Файл);
		
	КонецЕсли;
	
	ТаблицаФайлов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаФайлов;
	
КонецФункции

Функция ШиринаВидеоПоУмолчанию() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ШиринаПоУмолчанию = Константы.ШиринаВидеоПоУмолчаниюСУЗ.Получить();
	
	Возврат ?(ЗначениеЗаполнено(ШиринаПоУмолчанию), ШиринаПоУмолчанию, 640);
	
КонецФункции
